# 	Напишите программу для. проверки истинности утверждения
#  ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# ============================================================
x = input('Введите значение X : = ')
y = input('Введите значение Y : = ')
z = input('Введите значение Z : = ')
f = not (x or y or z)
f1 = not x and not y and not z
if((f) == (f1)):
    print("Да")
else:
    print('Нет')